# TessellatedShapeBuilderResult Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TessellatedShapeBuilderResult Methods
TessellatedShapeBuilderResult Class See Also
---
The TessellatedShapeBuilderResult type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetGeometricalObjects | When called the first time, returns geometrical objects which were built. Later calls will throw exceptions. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetIssuesForFaceSet | Returns the array of issues encountered while processing a face set with index 'setIndex'. |
| GetNumberOfFaceSets | Gets number of face sets for which 'this' result was obtained. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace